---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArrayIterator.Reset
source: html/d533b445-7f9b-da92-a220-804fc29860d3.htm
---
# Autodesk.Revit.DB.SymbolicCurveArrayIterator.Reset Method

Bring the iterator back to the start of the array.

## Syntax (C#)
```csharp
public virtual void Reset()
```

## Remarks
The Reset method will return the iterator back to the start of the array in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.